{
  "query": "LLNL-specific facilities that handle or handled STCs",
  "timestamp": "20250418_081043",
  "results": [
    {
      "text": "Past and current operations at LLNL have used special tritium compounds (STCs).  These include the following, organized by facility:\n Rotating Target Neutron Source Target Facilities (RTNS-II)\nMulti-thousand curie titanium-tritide targets were used at the now deactivated Rotating Target Neutron Source Facility (Building B292).  Tritium targets have been removed from this facility, however there is known tritium contamination in the target area and it is anticipated that some fraction of this contamination is STCs.  Therefore, STCs must be considered during facility maintenance activities and D&D operations.\n Building 331 (The 'Tritium  Facility'),\nGram quantities of tritium gas (generally T2) have been and may be handled in the Tritium Facility, Building 331.  Large quantities of tritium have been and may be present in the facility as hydrides on uranium or palladium storage beds, and as HTO in molecular sieve traps.  In some of the older containment structures (hoods, glove boxes) tritium was present as a metal tritide (e.g., titanium-tritide) or in other solid compounds. Preparation and handling of TiT2 targets, tritium recovery and grinder operations are known to have STCs.  According to the B331 monitoring plan for grinder operations, ZnO STCs are anticipated.\nRadioactive and Hazardous Waste Management (RHWM) buildings and facilities\n Tritium waste handling from other facilities at LLNL.",
      "similarity_score": 0.7144130491066293,
      "metadata": {
        "context": "",
        "filename": "591772.pdf",
        "page_numbers": [
          6,
          6,
          6,
          6,
          6,
          6,
          6
        ],
        "title": "C.8.2 LLNL Facility Specific Information"
      }
    },
    {
      "text": "In the past, several facilities associated with the NOVA laser project handled multi-curie quantities of tritium in small glass micro-spheres.  With decontamination and demolition of the NOVA target bay, the source of STC's in this facility no longer exists.",
      "similarity_score": 0.6595990117817495,
      "metadata": {
        "context": "",
        "filename": "591772.pdf",
        "page_numbers": [
          6
        ],
        "title": " NOVA Facilities"
      }
    },
    {
      "text": "In the past, titanium-tritide compounds have been used in a number of applications, including targets for neutron generators.  Compromised targets or other titanium-tritide compounds, can lead to particulate tritides.  Low to relatively high levels of tritium still remain in retired experimental facilities and areas pending decontamination and demolition (e.g., B212).  For past operations and facilities with legacy tritium contamination, STCs must be considered during facility maintenance activities and D&D operations.\nSeveral million telephone dials containing tritium were sent to LLNL for H3 recovery. Some dials were intentionally crushed using the B331 grinder (see B331 discussion above), until this effort was abandoned in 2011.  H3 bearing phone dials were staged in other buildings across the site (RHWM, B251, etc.) but not involved in any recovery activities, and hence intact phone dials should not pose internal STC exposure concerns.",
      "similarity_score": 0.5710336599460308,
      "metadata": {
        "context": "",
        "filename": "591772.pdf",
        "page_numbers": [
          7,
          7
        ],
        "title": " Other Facilities"
      }
    }
  ]
}