{
  "query": "Results of the ultrasound",
  "timestamp": "20250326_121833",
  "results": [
    {
      "text": "Figure C.8.43",
      "similarity_score": 0.6961703356048939,
      "metadata": {
        "context": "The chunk references \"Figure C.8.43,\" which is part of a section discussing the Minimum Detectable Doses (MDDs) for urine sampling of selected Type S Special Tritium Compounds (STCs) over various time frames after inhalation. This figure is part of a broader analysis of dose estimation and monitoring practices for STCs within a comprehensive technical document on radiological control and dosimetry at Lawrence Livermore National Laboratory.",
        "filename": "591772.pdf",
        "page_numbers": [
          72
        ],
        "title": "Minimum Detectable Doses - Type M STCs, 5 microns, AMAD"
      }
    },
    {
      "text": "Figure C.8.15\nFigure C.8.16",
      "similarity_score": 0.6895412939617453,
      "metadata": {
        "context": "This chunk references Figures C.8.15 and C.8.16, which are likely part of a series of figures illustrating the Derived Investigation Levels (DIL) for inhalation of selected Type F, M, and S special tritium compounds (STCs) over time, as discussed in the context of workplace monitoring and assessment of internal doses from STCs.",
        "filename": "591772.pdf",
        "page_numbers": [
          35,
          36
        ],
        "title": "Annual Limit of Intake vs. Particle Size Distribution (Actual Activity Inhaled)"
      }
    },
    {
      "text": "74\nFigure C.8.45",
      "similarity_score": 0.6870285678888062,
      "metadata": {
        "context": "This chunk references Figure C.8.45, which is part of a section discussing the Derived Investigation Levels (DILs) for various types of Special Tritium Compounds (STCs) in the context of monitoring and assessing internal exposures to tritium in workplace settings. The figure likely illustrates the calculated DIL values as a function of time after intake and helps in understanding the sensitivity of urine sampling for detecting STC intakes.",
        "filename": "591772.pdf",
        "page_numbers": [
          76,
          77
        ],
        "title": "Derived Investigation Levels - Type F STCs, 5 microns, AMAD"
      }
    }
  ]
}