{
  "query": "Dose conversion factors for titanium tritide for different particle sizes",
  "timestamp": "20250418_082344",
  "results": [
    {
      "text": "Figure C.8.9",
      "similarity_score": 0.8507862539555606,
      "metadata": {
        "context": "- Discusses dose conversion factors for inhalation intakes of special tritium compounds (STCs).\n- Follows detailed calculations and considerations of self-absorption factors for different STC materials.\n- Connects to broader themes of internal dosimetry and monitoring programs outlined earlier in the document.\n- Provides context for subsequent sections on urine bioassay factors and monitoring strategies related to STC exposure.",
        "filename": "591772.pdf",
        "page_numbers": [
          30
        ],
        "title": "Dose Conversion Factor vs. Particle Size Distribution for Type M STCs"
      }
    },
    {
      "text": "The key assumptions used for dosimetry modeling of inhalation intakes of STCs are as follows:\n1. The ICRP-66 respiratory tract model is used to calculate the deposition, retention, and absorption of inhaled Type F, Type M, and Type S tritiated particulates,\n2. The tritiated particulate is assumed to behave like the substrate (e.g., titanium, in the case of titanium-tritide) until it is absorbed from the respiratory tract and/or the GI tract  into the bloodstream,\n3. Unless specifically stated otherwise, f1 values for absorption from the GI Tract to the bloodstream are based on the substrate element, and taken from Table B.1. of ICRP-68,\n4. Upon absorption into the bloodstream (from either the lungs or GI Tract), the tritium is assumed to follow the biokinetic model of HTO,\n5. The beta particle emissions from tritium activity within STC particles in the respiratory tract or GI Tract regions are assumed to be attenuated.  The amount of attenuation is described by an energy 'Self Absorption Factor' or SAFe value - that represents the fraction of beta energy emitted from the particle. Currently, LLNL is using the methodology used by the Mound Technical Basis Document (Mound 2001) to calculate these SAFe values.\n(Note that these SAFe values are different from the 'beta particle Self Absorption Factors' SAF  which are used to convert 'observed' LSC activity to 'actual' LSC activity (see discussion below in Section C.8.7).)",
      "similarity_score": 0.8387124515632606,
      "metadata": {
        "context": "- Details key assumptions for dosimetry modeling of inhalation intakes of special tritium compounds (STCs).\n- Follows a discussion on the biokinetic models and factors affecting dose calculations.\n- Prepares the reader for subsequent sections on calculating dose conversion factors and specific modeling approaches.\n- Highlights distinctions between self-absorption factors relevant to beta emissions and those used in liquid scintillation counting.",
        "filename": "591772.pdf",
        "page_numbers": [
          8
        ],
        "title": "C.8.3.2 Dosimetry Modeling for Inhalation Intakes of STCs"
      }
    },
    {
      "text": "Figure C.8.8",
      "similarity_score": 0.8381628428480049,
      "metadata": {
        "context": "- Details dose conversion factors (DCFs) for various special tritium compounds (STCs) based on inhalation scenarios.\n- Follows previous sections on theoretical models and assumptions regarding STC behavior in biological systems.\n- Leads into practical applications, including derived air concentrations (DACs) and annual limits of intake (ALIs) for workplace monitoring.\n- Connects to overarching themes of internal dosimetry, risk assessment, and safety management in environments with potential tritium exposure.",
        "filename": "591772.pdf",
        "page_numbers": [
          29
        ],
        "title": "Dose Conversion Factor vs. Particle Size Distribution for Type F STCs"
      }
    }
  ]
}