{
  "query": " How is the self-absorption factor (SAFe) calculated for STCs and how does it impact dose?",
  "timestamp": "20250418_005445",
  "results": [
    {
      "text": "In the case of STCs, where some (or much) of the activity may be imbedded within metal particulates, a significant portion of the beta energy may be attenuated before the beta particle reaches any tissue.  Thus, for the source and target organs in which STCs may be present (the compartments of the respiratory tract and GI tract as indicated in red text in the Table above) an energy 'Self Absorption Factor' must be applied to the 'normal' tritium SEE for that source and target region.\nThese energy Self Absorption Factors (defined as the fraction of beta energy emitted from the STC particle) is a complex function of the material density, and the size and shape of the particle.  These SAFe values can range from about 1.0 (100% of energy emitted) for very small, low density materials, down to about 0.1 (10% of energy emitted) for large particle, high density materials.",
      "similarity_score": 0.8646369768088054,
      "metadata": {
        "context": "- Discusses the concept of energy Self Absorption Factors (SAFe) in relation to STCs and their impact on dose calculations.\n- Follows detailed explanations of STC dosimetry and the complexities associated with various material properties.\n- Connects to earlier sections on internal dosimetry, emphasizing the importance of accurate modeling for dose assessment.\n- Sets the stage for subsequent sections that likely explore practical applications and calculations involving SAFe values.",
        "filename": "591772.pdf",
        "page_numbers": [
          13
        ],
        "title": "C.8.3.5 Energy Self Absorption Factor (SAFe) Values"
      }
    },
    {
      "text": "SAF-energy values for distributions below 0.1 microns, AMAD, are assumed to be 1.0.\nThe LLNL-calculated SAFe values are plotted below in Figure C.8.3.  As might be expected, the SAFe value (fraction of energy emitted) drops dramatically as the particle diameter increases. As the AMAD drops below about 0.1 microns, the value of SAFe asymptotes to 1.0 (100% of the energy is available for deposition in tissue).  One can also see a 'spread' in values as a function of the material density.  This spread is most dramatic at the larger AMAD values.",
      "similarity_score": 0.8560059308208123,
      "metadata": {
        "context": "- Discusses energy self-absorption factor (SAFe) values related to tritium dosimetry.\n- Follows detailed analysis of dose conversion factors and their dependencies on particle size distribution.\n- Provides visual data representation (Figure C.8.3) to illustrate how SAFe varies with particle diameter and density.\n- Connects to broader themes of internal dosimetry and intake assessments within the overall framework of the document.",
        "filename": "591772.pdf",
        "page_numbers": [
          15
        ],
        "title": "Energy Self-Absorption Factors (SAFe) for Polydisperse Special Tritium Compounds a"
      }
    },
    {
      "text": "2 SAF-Beta values for distributions below 0.05 microns, AMAD, are assumed to be 1.0.\nThe LLNL-calculated SAF  values are plotted below in Figure C.8.48.  As might be expected,  the SAF  value (fraction of beta particles emitted) drops dramatically as the particle diameter  increases.  One can also see a 'spread' in values as a function of the material density.\nAs the AMAD drops below about 0.1 microns, the value of SAF  asymptotes to a value of 1.0  (100% of beta particles escape the STC particle and are counted.)  Unfortunately, the Mathcad log-normal function used to calculate SAF  values fails at AMAD values less than 0.1.  In order  to conservatively 'work around' this problem, SAF  values from 0.09 microns to 0.05 microns  AMAD are assumed to be 0.95 for all materials, and SAF  values below 0.05 microns AMAD  are assumed to be equal to 1.0 for all materials.  These assumptions produce the step-function like appearance seen at small particle size distributions in Figure C.8.48.\nFigure C.8.48",
      "similarity_score": 0.8250256479588101,
      "metadata": {
        "context": "- Details the calculation and assumptions of the Self Absorption Factor (SAF) for beta particles in special tritium compounds (STCs).\n- Follows prior sections discussing the significance of SAF in dosimetry modeling for STCs.\n- Connects to the overall theme of ensuring accurate dose assessments for inhaled STCs and their unique characteristics.\n- Prepares the reader for subsequent figures and discussions illustrating the implications of varying particle sizes on SAF values.",
        "filename": "591772.pdf",
        "page_numbers": [
          81,
          82
        ],
        "title": "Beta Particle Self-Absorption Factors (SAF )  for Polydisperse Special Tritium Compounds 1"
      }
    }
  ]
}