{
  "query": "what is the deal with the HOG transform?",
  "timestamp": "20250325_142855",
  "results": [
    {
      "text": "While the world of computer vision is often dominated by the complexity of neural algorithms, we wanted to explore the capabilities of classical machine learning algorithms on this vision task. We created a program to test data on 10 popular machine learning classifiers: SVM (Support Vector Machine), SGD (Stochastic Gradient Descent), RF (Random Forest), KNN (K-Nearest Neighbors), NB (Naive Bayes), DT (Decision Tree), LOGREG (Logistic Regression), MLP (Multilayer Perceptron), and VOTE (Voting Classifier -Ensemble of 5 previous classifiers). In an attempt to be as thorough as possible in testing these classical methods, we trained them on a variety of data, augmentation, and feature extraction combinations. For both the tumor and fetal dataset, each of these algorithms was tested with non-feature extracted data, HOG transformed data, and SIFT descriptor data -each in augmented and non-augmented form. The accuracy scores from the best augmentation-feature extraction pairs are shown below:\nAfter trying all possible augmentation-feature extraction combinations, we found that the non-augmented, HOG trans-\nAccuracy of Different Classification Algorithms and Ensembles\nformed data returned the highest model accuracy. Like we had originally hoped, the combinations that worked best for the tumor data also worked best for the fetal data. Interestingly, we found that in both datasets, data augmentation actually reduced accuracy. We're not sure if this is due to our augmentation methods, or if the small dataset causes issues with augmentation. We also interestingly found a difference in the specific best-performing model between the two datasets. The format of this paper renders the model labels in figures 5 and 6 basically unreadable, however, in figure 5, we see that the maximum accuracy is reported by the Voting ensemble method (far right bar) with an accuracy of 74% across the 3 classes of the tumor data. However, in the fetal data (figure 6) we see that our maximum accuracy is reported by the Stochastic Gradient Descent algorithm (far left bar) for an accuracy of 60% across the two classes.",
      "similarity_score": 0.6475250818829972,
      "metadata": {
        "context": "This chunk discusses the exploration and comparison of classical machine learning algorithms applied to ultrasound image classification tasks, focusing on both tumor and fetal datasets. It highlights the testing of various classifiers, the impact of data augmentation on accuracy, and identifies the best-performing models for each dataset.",
        "filename": "FetalUltrasounds.pdf",
        "page_numbers": [
          4
        ],
        "title": "A. Classical Machine Learning"
      }
    },
    {
      "text": "Index Terms -Computer Vision, Fetal Gender, Ultrasounds",
      "similarity_score": 0.6427729637998778,
      "metadata": {
        "context": "This chunk contains the \"Index Terms\" section of the document, which highlights key topics related to the research, specifically focusing on computer vision applications in determining fetal gender through ultrasound imaging. It serves as a thematic guide for the content discussed in the document.",
        "filename": "FetalUltrasounds.pdf",
        "page_numbers": [
          1
        ],
        "title": "A. Collection"
      }
    },
    {
      "text": "Braxton Owens\nComputer Science Department Brigham Young University Provo, USA Andrus.tn@gmail.com\nCollege of Physical and Mathematical Sciences Brigham Young University Provo, USA illiad@byu.edu\nAbstract - dept. of Computer Science Brigham Young University Provo, USA cbo27@byu.edu",
      "similarity_score": 0.6356464973289551,
      "metadata": {
        "context": "This chunk contains the author information, including names and email addresses, along with the abstract section from a research paper focused on using computer vision techniques for classifying fetal gender based on ultrasound images.",
        "filename": "FetalUltrasounds.pdf",
        "page_numbers": [
          1
        ],
        "title": "Nathan Fastabend"
      }
    }
  ]
}