{
  "query": "LLNL-specific facilities that handle or handled STCs",
  "timestamp": "20250418_110434",
  "results": [
    {
      "text": "Past and current operations at LLNL have used special tritium compounds (STCs).  These include the following, organized by facility:\n Rotating Target Neutron Source Target Facilities (RTNS-II)\nMulti-thousand curie titanium-tritide targets were used at the now deactivated Rotating Target Neutron Source Facility (Building B292).  Tritium targets have been removed from this facility, however there is known tritium contamination in the target area and it is anticipated that some fraction of this contamination is STCs.  Therefore, STCs must be considered during facility maintenance activities and D&D operations.\n Building 331 (The 'Tritium  Facility'),\nGram quantities of tritium gas (generally T2) have been and may be handled in the Tritium Facility, Building 331.  Large quantities of tritium have been and may be present in the facility as hydrides on uranium or palladium storage beds, and as HTO in molecular sieve traps.  In some of the older containment structures (hoods, glove boxes) tritium was present as a metal tritide (e.g., titanium-tritide) or in other solid compounds. Preparation and handling of TiT2 targets, tritium recovery and grinder operations are known to have STCs.  According to the B331 monitoring plan for grinder operations, ZnO STCs are anticipated.\nRadioactive and Hazardous Waste Management (RHWM) buildings and facilities\n Tritium waste handling from other facilities at LLNL.",
      "similarity_score": 0.7144130491066293,
      "metadata": {
        "context": "",
        "filename": "591772.pdf",
        "page_numbers": [
          6,
          6,
          6,
          6,
          6,
          6,
          6
        ],
        "title": "C.8.2 LLNL Facility Specific Information"
      }
    },
    {
      "text": "In the past, several facilities associated with the NOVA laser project handled multi-curie quantities of tritium in small glass micro-spheres.  With decontamination and demolition of the NOVA target bay, the source of STC's in this facility no longer exists.",
      "similarity_score": 0.6595990117817495,
      "metadata": {
        "context": "",
        "filename": "591772.pdf",
        "page_numbers": [
          6
        ],
        "title": " NOVA Facilities"
      }
    },
    {
      "text": "In the past, titanium-tritide compounds have been used in a number of applications, including targets for neutron generators.  Compromised targets or other titanium-tritide compounds, can lead to particulate tritides.  Low to relatively high levels of tritium still remain in retired experimental facilities and areas pending decontamination and demolition (e.g., B212).  For past operations and facilities with legacy tritium contamination, STCs must be considered during facility maintenance activities and D&D operations.\nSeveral million telephone dials containing tritium were sent to LLNL for H3 recovery. Some dials were intentionally crushed using the B331 grinder (see B331 discussion above), until this effort was abandoned in 2011.  H3 bearing phone dials were staged in other buildings across the site (RHWM, B251, etc.) but not involved in any recovery activities, and hence intact phone dials should not pose internal STC exposure concerns.",
      "similarity_score": 0.5710336599460308,
      "metadata": {
        "context": "",
        "filename": "591772.pdf",
        "page_numbers": [
          7,
          7
        ],
        "title": " Other Facilities"
      }
    },
    {
      "text": "LLNL 2013. Spectroscopy Laboratory Procedure Manual - Alpha Spectroscopy , SLAB-01 Rev 0.0, December 11, 2013.\nLLNL 2014a. Bioassay Laboratory Administration , RP-BLAB-001, Rev 0, April 25, 2014.\nLLNL 2014b. Spectroscopy Laboratory Procedure Manual - Gamma Spectroscopy , SLAB-02 Rev 0.0, May 1, 2014.\nLLNL 2014c. Reporting Occurrences to DOE , PRO-0082, July 14, 2014.\nLLNL 2014d. Environment, Safety, and Health Manual, Volume I, Document 1.2, ES&H Policies of LLNL , July 22, 2014.\nLLNL 2014e. Radiation Protection Functional Area Quality Assurance Plan, LLNL-AM-665565, RP-DES-001 Rev 0.1, December 5, 2014.\nLLNL 2014f. Environment, Safety, and Health Manual, Volume II, Document 10.1, Occupational Medical Program , September 17, 2014.\nLLNL 2015a. Environment, Safety, and Health Manual, Volume II, Document 20.2, LLNL Radiological Safety Program for Radioactive Materials , March 2, 2015.\nLLNL 2015b. Environment, Safety, and Health Manual, Volume II, Document 20.1, Occupational Radiation Protection , March 27, 2015.\nLLNL 2015c. Completing the Radiation/Contamination Survey Form , HP-FO-120 Rev 2.2, May 15, 2015.\nLLNL 2015d. Identification and Response to Unexpected Radiological Conditions , HP-FO-601 Rev 1.0, June 22, 2015.\nLLNL 2015e. LLNL Technical Basis Manual for Internal Dosimetry , Rev. 3 in draft as of October 2015.\nMansfield 2012. W. G. Mansfield, et al., Internal Dosimetry and Monitoring for Special Tritium Compounds (STCs) , LLNL-TM-565620, July 20, 2012.",
      "similarity_score": 0.5648091108913038,
      "metadata": {
        "context": "",
        "filename": "801449.pdf",
        "page_numbers": [
          154,
          154,
          154,
          154,
          155,
          155,
          155,
          155,
          155,
          155,
          155,
          155,
          155
        ],
        "title": "Appendix E: References"
      }
    },
    {
      "text": "Assessment and reporting of doses from intakes of STCs shall be performed using the guidelines of Section 9 of the LLNL IDPM (Mansfield 2009a) and the general recommendations of Section 5 of the DOE Handbook (DOE 2006).",
      "similarity_score": 0.5175670421149362,
      "metadata": {
        "context": "",
        "filename": "591772.pdf",
        "page_numbers": [
          110
        ],
        "title": "C.8.9.5 Assessment of Doses from Intakes of STCs"
      }
    },
    {
      "text": "In general, this Manual applies to all LLNL facilities and programs conducted or managed under the auspices of LLNL in which unencapsulated radioactive materials are used. Requirements for off-site activities involving LLNL personnel will be determined on a case-by-case basis by the ES&H Team HP with concurrence from Internal Dosimetry. Not all facilities will require internal dose (worker or workplace) monitoring programs, but such facilities and activities should be evaluated for the need for internal dose monitoring programs.",
      "similarity_score": 0.5174321022988251,
      "metadata": {
        "context": "",
        "filename": "801449.pdf",
        "page_numbers": [
          12
        ],
        "title": "1.3 APPLICABILITY"
      }
    }
  ]
}