{
  "query": "What is the relationship between the DIL and the MDA, and how does it affect monitoring frequency selection?",
  "timestamp": "20250418_112943",
  "results": [
    {
      "text": "The relationship between MDAs and DILs should be carefully considered when selecting bioassay methods and frequencies for a monitoring program. In general, the value of the DIL will decrease as the length of the monitoring interval increases. This decrease is due to the fact that as the time between the intake and the measurement increases, the fraction of intake that is represented by that measurement results usually decreases. Thus, all other things being equal, the dosimetric significance of a unit of activity in the sample increases. Thus, DILs are used to visualize the dosimetric sensitivity of a particular monitoring method as a function of monitoring interval.\nWhen using DILs to design a bioassay program, one would typically compare the DIL values to the MDA for a particular monitoring method. It would not be unusual, for example, to find that as the monitoring interval is increased, the DIL remains above the MDA for some time, then drops below the MDA as the monitoring interval reaches some critical time post-intake.\nIf the slope of the DIL as a function of monitoring interval is relatively flat, the implication is that the dosimetric sensitivity of the monitoring method is not particularly sensitive to changes in monitoring interval. If, however, the slope is relatively steep, the implication is that dosimetric sensitivity may be lost very rapidly as the monitoring interval increases. This consideration may have a significant impact on the selection of appropriate or desirable monitoring frequencies.\nThe relative relationship between these two concepts will depend upon the particular radionuclide; some representative cases are illustrated in Figure 5.2. In these example graphs, the",
      "similarity_score": 0.7218134516149437,
      "metadata": {
        "context": "",
        "filename": "801449.pdf",
        "page_numbers": [
          34,
          34,
          34,
          34
        ],
        "title": "5.9.3 Relationship between DIL and MDA"
      }
    },
    {
      "text": "If practicable, the type and frequency of measurements used in routine bioassay programs should be selected such that it is unlikely for intakes leading to doses of 0.1 rem CED or greater to go unrecognized and unassessed. In order to meet this level of sensitivity, the MDD for a particular radioactive material and selected measurement frequency should be less than 0.1 rem. Equivalently, the measurement method should be able to detect levels of activity at or below the appropriate DIL.\nA standard method for comparing bioassay methods and frequencies is to compare the DIL for a particular type and frequency of bioassay to the MDA for that measurement method. The DIL should not be confused with the statistical Decision Level (LC) presented in Section 5.3.2 of this Manual. The DIL is related solely to the dosimetric significance of the activity in the bioassay measurement and has nothing to do with the detection decision for that measurement. In contrast, the Decision Level is based solely on measurement statistics and has nothing to do with implied intake or dose.",
      "similarity_score": 0.6327297010223712,
      "metadata": {
        "context": "",
        "filename": "801449.pdf",
        "page_numbers": [
          34,
          34
        ],
        "title": "5.9.2 Criteria for Selection-Use of DILs or MDDs"
      }
    },
    {
      "text": "Since the DIL( ) is a constant value multiplied by the intake excretion or retention fraction F( ), t t the shape of the DIL curve is identical to that of the excretion or retention fraction curve. It is important to recognize that the DIL has nothing to do with the detection abilities of a particular monitoring method (as represented by the MDA); it is solely a function of the dosimetric significance of activity in a monitoring result.\nFor the purposes of routine bioassay program planning and operation, DILs are based on the assumption that a single intake occurred immediately after the last bioassay measurement . In most cases, this interpretation provides a 'worst-case' estimate of intake and dose. For example, in the case of semiannual urine sampling, the IEF value for the 180 th day after intake would be used to establish the DIL.\nLLNL facilities and operations are designed so that no significant intakes of radioactive materials are expected to occur during normal operations. With the exception of tritium operations and some depleted uranium operations at Site 300, multiple intakes occurring in one calendar year are considered unlikely. Accordingly, LLNL does not partition the Investigation Levels and associated DILs as a function of the number of monitoring intervals during the year.\nIf operations do arise in which multiple intakes are expected during routine operations, partitioned DILs will be developed by the Internal Dosimetry Team and the ES&H Team HP on a case-by-case basis.",
      "similarity_score": 0.5695610152463073,
      "metadata": {
        "context": "",
        "filename": "801449.pdf",
        "page_numbers": [
          31,
          31,
          31,
          31
        ],
        "title": "Chapter 5: Technical Basis for a Routine Internal Dose Monitoring Program"
      }
    }
  ]
}